In [1]:
import pandas as pd
internal1 = {'s1':21,'s2':24,'s3':45}
internal1=pd.Series(internal1)
internal1

s1    21
s2    24
s3    45
dtype: int64

In [2]:
internal2 = {'d1':23,'d2':45,'d3':12}
internal = {'Internal1':internal1,'Internal2':internal2}
internal = pd.DataFrame(internal)
internal

    Internal1  Internal2
d1        NaN       23.0
d2        NaN       45.0
d3        NaN       12.0
s1       21.0        NaN
s2       24.0        NaN
s3       45.0        NaN

In [5]:
internal3 = {'f1':89,'f2':91,'f3':80}
internal = {'Internal1':internal1,'Internal2':internal2,'Internal3':internal3}
internal=pd.DataFrame(internal)
internal

    Internal1  Internal2  Internal3
d1        NaN       23.0        NaN
d2        NaN       45.0        NaN
d3        NaN       12.0        NaN
f1        NaN        NaN       89.0
f2        NaN        NaN       91.0
f3        NaN        NaN       80.0
s1       21.0        NaN        NaN
s2       24.0        NaN        NaN
s3       45.0        NaN        NaN

In [6]:
internal3 = pd.Series(internal3)
internal3

f1    89
f2    91
f3    80
dtype: int64

In [8]:
internal.columns

Index(['Internal1', 'Internal2', 'Internal3'], dtype='object')

In [9]:
internal.values

array([[nan, 23., nan],
       [nan, 45., nan],
       [nan, 12., nan],
       [nan, nan, 89.],
       [nan, nan, 91.],
       [nan, nan, 80.],
       [21., nan, nan],
       [24., nan, nan],
       [45., nan, nan]])

In [10]:
internal.values[3]

array([nan, nan, 89.])

In [14]:
internal.values[2,1]   # Acessing the 2rd row 1st column value

12.0

In [17]:
internal.values[2][1]

12.0

In [20]:
for row in internal.values:
    print('internal1 -',row[0],'internal2 - ',row[1],'internal3 -',row[2])

internal1 - nan internal2 -  23.0 internal3 - nan
internal1 - nan internal2 -  45.0 internal3 - nan
internal1 - nan internal2 -  12.0 internal3 - nan
internal1 - nan internal2 -  nan internal3 - 89.0
internal1 - nan internal2 -  nan internal3 - 91.0
internal1 - nan internal2 -  nan internal3 - 80.0
internal1 - 21.0 internal2 -  nan internal3 - nan
internal1 - 24.0 internal2 -  nan internal3 - nan
internal1 - 45.0 internal2 -  nan internal3 - nan

In [21]:
inter1={'s1':23,'s2':45,'s3':46}
inter2={'s1':34,'s2':30,'s3':25}
inter = {'Inter1':inter1,'Inter2':inter2}
inter=pd.DataFrame(inter)
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25

In [22]:
for row in inter.values:
    print('Inter1 -',row[0],'Inter2 -',row[1])

Inter1 - 23 Inter2 - 34
Inter1 - 45 Inter2 - 30
Inter1 - 46 Inter2 - 25

In [23]:
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25

In [24]:
inter.loc['s4']=[19,91]

In [25]:
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25
s4      19      91

In [26]:
inter.loc['3']=[89,90]

In [27]:
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25
s4      19      91
3       89      90

In [29]:
inter.drop('3')

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25
s4      19      91

In [30]:
inter.drop('s4')

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25
3       89      90

In [34]:
inter=inter.drop('s4')

In [35]:
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25

In [38]:
inter.loc['s4']=[23,67]
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25
s4      23      67

In [40]:
inter =inter.drop('s4')
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25

In [41]:
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      25

In [45]:
inter.values[2,1]=78

In [46]:
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      46      78

In [47]:
inter.values[2]=[35,85]
inter

    Inter1  Inter2
s1      23      34
s2      45      30
s3      35      85

In [50]:
# Reading a CSV file
import pandas as pd
filepath='DataFiles/pandaa.csv'
incomedf=pd.read_csv(filepath)
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [51]:
# Function to read CSV data into a DataFrame and 
# Return the DataFrame object
def readCSVdata(filepath):
    return pd.read_csv(filepath)

filepath='DataFiles/Income.csv'
readCSVdata(filepath)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [53]:
incomedf=readCSVdata(filepath)

# Function to print all the colums
# GEOID State 2005 2006 2007 2008 2009 2010 2011 2012 2013

def columns(df):
    col=df.columns
    for col in df.columns:
        print(col,end=' ')
    return
columns(incomedf)

GEOID State 2005 2006 2007 2008 2009 2010 2011 2012 2013